{
  "data": [
    {
      "_id": 1,
      "dates": "2025 – Present",
      "title": "Software Engineer • Azula Investment Group LLC",
      "description": [
        "Designed and scaled a multi-tenant platform for tattoo studios covering consultations, artist dashboards, bookings, deals, and client workflows.",
        "Built an ASP.NET Core API with an Angular 19 front end backed by PostgreSQL to deliver a scalable, enterprise-grade architecture.",
        "Integrated Azure Blob Storage for media management and Azure Communication Services for SMS notifications that keep clients engaged.",
        "Executed targeted Facebook and Instagram campaigns that produced 1,619 link clicks ($0.10 CPC), 20,715 reach, 28,068 impressions, and roughly 50 client signups."
      ],
      "technologies": [
        "ASP.NET Core",
        "Angular 19",
        "PostgreSQL",
        "Azure Blob Storage",
        "Azure Communication Services",
        "REST APIs",
        "Azure"
      ]
    },
    {
      "_id": 2,
      "dates": "Oct 2023 – 2025",
      "title": "Software Developer • Azula Investment Group LLC",
      "description": [
        "Automated production planning by parsing PDFs and sorting plans with a Django and Angular solution that integrates Oracle JD Edwards and PostgreSQL.",
        "Streamlined ERP workflows to reduce manual data entry, decrease waste, and improve scheduling accuracy across multiple production lines."
      ],
      "technologies": [
        "Django",
        "Angular",
        "Oracle JD Edwards",
        "PostgreSQL",
        "ERP Automation",
        "SSRS"
      ]
    },
    {
      "_id": 3,
      "dates": "2023 – 2023",
      "title": "Research Assistant • Fort Hays State University",
      "description": [
        "Improved bioinformatics pipelines through automation and algorithm optimization to splice and organize plant DNA genomes.",
        "Contributed software to a published scientific study by enhancing plastome data processing workflows."
      ],
      "technologies": [
        "Python",
        "Bioinformatics",
        "Data Processing",
        "Automation"
      ]
    }
  ]
}
